Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
/*! @name OTP_SHADOW_PARTA - OTP shadow register */
/*! @{ */

#define OCOTP_OTP_SHADOW_PARTA_SHADOW_MASK       (0xFFFFFFFFU)
#define OCOTP_OTP_SHADOW_PARTA_SHADOW_SHIFT      (0U)
/*! SHADOW - OTP shadow register, fsb have read access of shadow 0-47 (offset should be 0*4-47*4) */
#define OCOTP_OTP_SHADOW_PARTA_SHADOW(x)         (((uint32_t)(((uint32_t)(x)) << OCOTP_OTP_SHADOW_PARTA_SHADOW_SHIFT)) & OCOTP_OTP_SHADOW_PARTA_SHADOW_MASK)
/*! @} */

/*! @name OTP_SHADOW_PARTB - OTP shadow register */
/*! @{ */

#define OCOTP_OTP_SHADOW_PARTB_SHADOW_MASK       (0xFFFFFFFFU)
#define OCOTP_OTP_SHADOW_PARTB_SHADOW_SHIFT      (0U)
/*! SHADOW - OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4) */
#define OCOTP_OTP_SHADOW_PARTB_SHADOW(x)         (((uint32_t)(((uint32_t)(x)) << OCOTP_OTP_SHADOW_PARTB_SHADOW_SHIFT)) & OCOTP_OTP_SHADOW_PARTB_SHADOW_MASK)
/*! @} */

/*! @name CTRL - OTP Controller Control Register */
/*! @{ */

#define OCOTP_CTRL_ADDR_MASK                     (0x1FFU)
#define OCOTP_CTRL_ADDR_SHIFT                    (0U)
#define OCOTP_CTRL_ADDR(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_ADDR_SHIFT)) & OCOTP_CTRL_ADDR_MASK)

#define OCOTP_CTRL_PRNG_OUTPUT_DATA_EN_MASK      (0x200U)
#define OCOTP_CTRL_PRNG_OUTPUT_DATA_EN_SHIFT     (9U)
#define OCOTP_CTRL_PRNG_OUTPUT_DATA_EN(x)        (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_PRNG_OUTPUT_DATA_EN_SHIFT)) & OCOTP_CTRL_PRNG_OUTPUT_DATA_EN_MASK)

#define OCOTP_CTRL_SRAM_ENTROPY_DATA_EN_MASK     (0x400U)
#define OCOTP_CTRL_SRAM_ENTROPY_DATA_EN_SHIFT    (10U)
#define OCOTP_CTRL_SRAM_ENTROPY_DATA_EN(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_SRAM_ENTROPY_DATA_EN_SHIFT)) & OCOTP_CTRL_SRAM_ENTROPY_DATA_EN_MASK)

#define OCOTP_CTRL_RELOAD_SHADOWS_MASK           (0x800U)
#define OCOTP_CTRL_RELOAD_SHADOWS_SHIFT          (11U)
#define OCOTP_CTRL_RELOAD_SHADOWS(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_RELOAD_SHADOWS_SHIFT)) & OCOTP_CTRL_RELOAD_SHADOWS_MASK)

#define OCOTP_CTRL_RED_MUX_SEL_MASK              (0x3000U)
#define OCOTP_CTRL_RED_MUX_SEL_SHIFT             (12U)
#define OCOTP_CTRL_RED_MUX_SEL(x)                (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_RED_MUX_SEL_SHIFT)) & OCOTP_CTRL_RED_MUX_SEL_MASK)

#define OCOTP_CTRL_SUPPADD_MASK                  (0x4000U)
#define OCOTP_CTRL_SUPPADD_SHIFT                 (14U)
#define OCOTP_CTRL_SUPPADD(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_SUPPADD_SHIFT)) & OCOTP_CTRL_SUPPADD_MASK)

#define OCOTP_CTRL_WORDLOCK_MASK                 (0x8000U)
#define OCOTP_CTRL_WORDLOCK_SHIFT                (15U)
#define OCOTP_CTRL_WORDLOCK(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_WORDLOCK_SHIFT)) & OCOTP_CTRL_WORDLOCK_MASK)

#define OCOTP_CTRL_WR_UNLOCK_MASK                (0xFFFF0000U)
#define OCOTP_CTRL_WR_UNLOCK_SHIFT               (16U)
#define OCOTP_CTRL_WR_UNLOCK(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_WR_UNLOCK_MASK)
/*! @} */

/*! @name HW_OCOTP_WRITE_DATA - OTP Controller Write Data Register */
/*! @{ */

#define OCOTP_HW_OCOTP_WRITE_DATA_WRITE_DATA_MASK (0xFFFFFFFFU)
#define OCOTP_HW_OCOTP_WRITE_DATA_WRITE_DATA_SHIFT (0U)
#define OCOTP_HW_OCOTP_WRITE_DATA_WRITE_DATA(x)  (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_WRITE_DATA_WRITE_DATA_SHIFT)) & OCOTP_HW_OCOTP_WRITE_DATA_WRITE_DATA_MASK)
/*! @} */

/*! @name READ_CTRL - OTP Controller Read Ctrl Register */
/*! @{ */

#define OCOTP_READ_CTRL_READ_MASK                (0x1U)
#define OCOTP_READ_CTRL_READ_SHIFT               (0U)
#define OCOTP_READ_CTRL_READ(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_CTRL_READ_SHIFT)) & OCOTP_READ_CTRL_READ_MASK)
/*! @} */

/*! @name HW_OCOTP_READ_DATA - OTP Controller Read Data Register */
/*! @{ */

#define OCOTP_HW_OCOTP_READ_DATA_READ_DATA_MASK  (0xFFFFFFFFU)
#define OCOTP_HW_OCOTP_READ_DATA_READ_DATA_SHIFT (0U)
#define OCOTP_HW_OCOTP_READ_DATA_READ_DATA(x)    (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_READ_DATA_READ_DATA_SHIFT)) & OCOTP_HW_OCOTP_READ_DATA_READ_DATA_MASK)
/*! @} */

/*! @name HW_OCOTP_STATUS - OTP Controller Status Register */
/*! @{ */

#define OCOTP_HW_OCOTP_STATUS_LOAD_COUNTER_MASK  (0x1FFU)
#define OCOTP_HW_OCOTP_STATUS_LOAD_COUNTER_SHIFT (0U)
#define OCOTP_HW_OCOTP_STATUS_LOAD_COUNTER(x)    (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_LOAD_COUNTER_SHIFT)) & OCOTP_HW_OCOTP_STATUS_LOAD_COUNTER_MASK)

#define OCOTP_HW_OCOTP_STATUS_LC_NOT_BLANK_STICKY_MASK (0x200U)
#define OCOTP_HW_OCOTP_STATUS_LC_NOT_BLANK_STICKY_SHIFT (9U)
#define OCOTP_HW_OCOTP_STATUS_LC_NOT_BLANK_STICKY(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_LC_NOT_BLANK_STICKY_SHIFT)) & OCOTP_HW_OCOTP_STATUS_LC_NOT_BLANK_STICKY_MASK)

#define OCOTP_HW_OCOTP_STATUS_LOCKED_MASK        (0x800U)
#define OCOTP_HW_OCOTP_STATUS_LOCKED_SHIFT       (11U)
#define OCOTP_HW_OCOTP_STATUS_LOCKED(x)          (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_LOCKED_SHIFT)) & OCOTP_HW_OCOTP_STATUS_LOCKED_MASK)

#define OCOTP_HW_OCOTP_STATUS_PROGFAIL_MASK      (0x1000U)
#define OCOTP_HW_OCOTP_STATUS_PROGFAIL_SHIFT     (12U)
#define OCOTP_HW_OCOTP_STATUS_PROGFAIL(x)        (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_PROGFAIL_SHIFT)) & OCOTP_HW_OCOTP_STATUS_PROGFAIL_MASK)

#define OCOTP_HW_OCOTP_STATUS_ACK_MASK           (0x2000U)
#define OCOTP_HW_OCOTP_STATUS_ACK_SHIFT          (13U)
#define OCOTP_HW_OCOTP_STATUS_ACK(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_ACK_SHIFT)) & OCOTP_HW_OCOTP_STATUS_ACK_MASK)

#define OCOTP_HW_OCOTP_STATUS_PWOK_MASK          (0x4000U)
#define OCOTP_HW_OCOTP_STATUS_PWOK_SHIFT         (14U)
#define OCOTP_HW_OCOTP_STATUS_PWOK(x)            (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_PWOK_SHIFT)) & OCOTP_HW_OCOTP_STATUS_PWOK_MASK)

#define OCOTP_HW_OCOTP_STATUS_PWOKFAIL_MASK      (0x8000U)
#define OCOTP_HW_OCOTP_STATUS_PWOKFAIL_SHIFT     (15U)
#define OCOTP_HW_OCOTP_STATUS_PWOKFAIL(x)        (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_PWOKFAIL_SHIFT)) & OCOTP_HW_OCOTP_STATUS_PWOKFAIL_MASK)

#define OCOTP_HW_OCOTP_STATUS_FLAGSTATE_MASK     (0xF0000U)
#define OCOTP_HW_OCOTP_STATUS_FLAGSTATE_SHIFT    (16U)
#define OCOTP_HW_OCOTP_STATUS_FLAGSTATE(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_FLAGSTATE_SHIFT)) & OCOTP_HW_OCOTP_STATUS_FLAGSTATE_MASK)

