Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_MASK_CTRL1_TMEOUT_COUNTER_EN_MASK (0x8U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_TMEOUT_COUNTER_EN_SHIFT (3U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_TMEOUT_COUNTER_EN(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_TMEOUT_COUNTER_EN_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_TMEOUT_COUNTER_EN_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PBRICK_ERR_MASK (0x20U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PBRICK_ERR_SHIFT (5U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PBRICK_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PBRICK_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PBRICK_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_OTP_STATE_ERR_MASK (0x40U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_OTP_STATE_ERR_SHIFT (6U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_OTP_STATE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_OTP_STATE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_OTP_STATE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_RELOAD_MASK (0x80U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_RELOAD_SHIFT (7U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_RELOAD_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_MASK (0x100U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_SHIFT (8U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_DED_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_RELOAD_MASK (0x200U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_RELOAD_SHIFT (9U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_RELOAD_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_MASK (0x400U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_SHIFT (10U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SEC_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_DONE_MASK (0x800U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_DONE_SHIFT (11U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_DONE(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_DONE_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_DONE_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_LUT_SEL_ERR_MASK (0x1000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_LUT_SEL_ERR_SHIFT (12U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_LUT_SEL_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_LUT_SEL_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_LUT_SEL_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_ADDRESS_RANGE_ERR_MASK (0x2000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_ADDRESS_RANGE_ERR_SHIFT (13U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_ADDRESS_RANGE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_ADDRESS_RANGE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_ADDRESS_RANGE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_WRITE_PROTECT_ERR_MASK (0x4000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_WRITE_PROTECT_ERR_SHIFT (14U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_WRITE_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_WRITE_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_WRITE_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_SECURTY_PROTECT_ERR_MASK (0x8000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_SECURTY_PROTECT_ERR_SHIFT (15U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_SECURTY_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_SECURTY_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_CRC_SECURTY_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_ERR_MASK (0x10000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_ERR_SHIFT (16U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_LOAD_ERR_MASK (0x20000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_LOAD_ERR_SHIFT (17U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_LOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_LOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_LOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_COUNTER_ERR_MASK (0x40000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_COUNTER_ERR_SHIFT (18U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_COUNTER_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_COUNTER_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_COUNTER_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_BITPROTECT_ERR_MASK (0x80000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_BITPROTECT_ERR_SHIFT (19U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_BITPROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_BITPROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_BITPROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PRNG_O_FAULT_MASK (0x100000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PRNG_O_FAULT_SHIFT (20U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PRNG_O_FAULT(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PRNG_O_FAULT_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_PRNG_O_FAULT_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_ECC_ZEROIZED_ERR_MASK (0x200000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_ECC_ZEROIZED_ERR_SHIFT (21U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_ECC_ZEROIZED_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_ECC_ZEROIZED_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_ECC_ZEROIZED_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_ACCESS_ERR_MASK (0x400000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_ACCESS_ERR_SHIFT (22U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_ACCESS_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_ACCESS_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_ACCESS_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_RELOAD_REQ_ERR_MASK (0x800000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_RELOAD_REQ_ERR_SHIFT (23U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_RELOAD_REQ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_RELOAD_REQ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_RELOAD_REQ_ERR_MASK)

