Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_ECC_ZEROIZED_ERR_MASK (0x200000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_ECC_ZEROIZED_ERR_SHIFT (21U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_ECC_ZEROIZED_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_ECC_ZEROIZED_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_ECC_ZEROIZED_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_ACCESS_ERR_MASK (0x400000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_ACCESS_ERR_SHIFT (22U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_ACCESS_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_ACCESS_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_ACCESS_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_RELOAD_REQ_ERR_MASK (0x800000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_RELOAD_REQ_ERR_SHIFT (23U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_RELOAD_REQ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_RELOAD_REQ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_RELOAD_REQ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_DURING_RELOAD_ERR_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_DURING_RELOAD_ERR_SHIFT (24U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_DURING_RELOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_DURING_RELOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_DURING_RELOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_READ_ERR_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_READ_ERR_SHIFT (25U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_WRITE_ERR_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_WRITE_ERR_SHIFT (26U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_HVF_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_READ_ERR_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_READ_ERR_SHIFT (27U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_WRITE_ERR_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_WRITE_ERR_SHIFT (28U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_SRAM_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_READ_ERR_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_READ_ERR_SHIFT (29U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_PROG_ERR_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_PROG_ERR_SHIFT (30U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_PROG_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_PROG_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_FUSE_PROG_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_NO_ACCESS_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_NO_ACCESS_SHIFT (31U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_NO_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_NO_ACCESS_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SHADOW_NO_ACCESS_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_0 - OTP Controller Lock Sticky Register0 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT0_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT0_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT0(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT0_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT0_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT1_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT1_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT1(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT1_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT1_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT2_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT2_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT2(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT2_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT2_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT3_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT3_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT3(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT3_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT3_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT4_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT4_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT4(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT4_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT4_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT5_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT5_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT5(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT5_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT5_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT6_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT6_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT6(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT6_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT6_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT7_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT7_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT7(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT7_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT7_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT8_MASK (0x100U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT8_SHIFT (8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT8(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT8_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT8_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT9_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT9_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT9(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT9_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT9_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT10_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT10_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT10(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT10_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT10_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT11_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT11_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT11(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT11_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT11_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT12_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT12_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT12(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT12_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT12_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT13_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT13_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT13(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT13_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT13_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT14_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT14_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT14(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT14_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT14_MASK)

