Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT35_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT35_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT35(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT35_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT35_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT36_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT36_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT36(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT36_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT36_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT37_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT37_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT37(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT37_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT37_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT38_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT38_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT38(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT38_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT38_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT39_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT39_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT39(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT39_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT39_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT40_MASK (0x100U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT40_SHIFT (8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT40(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT40_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT40_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT41_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT41_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT41(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT41_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT41_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT42_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT42_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT42(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT42_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT42_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT43_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT43_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT43(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT43_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT43_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT44_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT44_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT44(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT44_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT44_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT45_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT45_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT45(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT45_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT45_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT46_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT46_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT46(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT46_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT46_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT47_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT47_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT47(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT47_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT47_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT48_MASK (0x10000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT48_SHIFT (16U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT48(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT48_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT48_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT49_MASK (0x20000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT49_SHIFT (17U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT49(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT49_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT49_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT50_MASK (0x40000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT50_SHIFT (18U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT50(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT50_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT50_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT51_MASK (0x80000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT51_SHIFT (19U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT51(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT51_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT51_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT52_MASK (0x100000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT52_SHIFT (20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT52(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT52_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT52_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT53_MASK (0x200000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT53_SHIFT (21U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT53(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT53_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT53_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT54_MASK (0x400000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT54_SHIFT (22U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT54(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT54_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT54_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT55_MASK (0x800000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT55_SHIFT (23U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT55(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT55_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT55_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT56_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT56_SHIFT (24U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT56(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT56_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT56_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT57_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT57_SHIFT (25U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT57(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT57_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT57_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT58_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT58_SHIFT (26U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT58(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT58_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT58_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT59_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT59_SHIFT (27U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT59(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT59_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT59_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT60_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT60_SHIFT (28U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT60(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT60_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT60_MASK)

