Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT79_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT79_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT79(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT79_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT79_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT80_MASK (0x10000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT80_SHIFT (16U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT80(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT80_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT80_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT81_MASK (0x20000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT81_SHIFT (17U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT81(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT81_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT81_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT82_MASK (0x40000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT82_SHIFT (18U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT82(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT82_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT82_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT83_MASK (0x80000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT83_SHIFT (19U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT83(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT83_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT83_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT84_MASK (0x100000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT84_SHIFT (20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT84(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT84_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT84_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT85_MASK (0x200000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT85_SHIFT (21U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT85(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT85_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT85_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT86_MASK (0x400000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT86_SHIFT (22U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT86(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT86_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT86_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT87_MASK (0x800000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT87_SHIFT (23U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT87(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT87_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT87_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT88_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT88_SHIFT (24U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT88(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT88_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT88_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT89_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT89_SHIFT (25U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT89(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT89_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT89_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT90_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT90_SHIFT (26U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT90(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT90_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT90_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT91_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT91_SHIFT (27U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT91(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT91_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT91_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT92_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT92_SHIFT (28U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT92(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT92_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT92_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT93_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT93_SHIFT (29U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT93(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT93_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT93_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT94_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT94_SHIFT (30U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT94(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT94_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT94_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT95_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT95_SHIFT (31U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT95(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT95_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT95_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_3 - OTP Controller Lock Sticky Register3 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT96_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT96_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT96(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT96_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT96_MASK)

