Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT97_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT97_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT97(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT97_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT97_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT98_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT98_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT98(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT98_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT98_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT99_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT99_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT99(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT99_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT99_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT100_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT100_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT100(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT100_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT100_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT101_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT101_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT101(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT101_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT101_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT102_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT102_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT102(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT102_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT102_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT103_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT103_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT103(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT103_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT103_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT104_MASK (0x100U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT104_SHIFT (8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT104(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT104_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT104_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT105_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT105_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT105(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT105_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT105_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT106_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT106_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT106(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT106_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT106_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT107_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT107_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT107(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT107_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT107_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT108_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT108_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT108(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT108_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT108_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT109_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT109_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT109(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT109_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT109_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT110_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT110_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT110(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT110_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT110_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT111_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT111_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT111(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT111_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT111_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT112_MASK (0x10000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT112_SHIFT (16U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT112(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT112_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT112_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT113_MASK (0x20000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT113_SHIFT (17U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT113(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT113_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT113_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT114_MASK (0x40000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT114_SHIFT (18U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT114(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT114_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT114_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT115_MASK (0x80000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT115_SHIFT (19U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT115(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT115_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT115_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT116_MASK (0x100000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT116_SHIFT (20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT116(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT116_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT116_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT117_MASK (0x200000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT117_SHIFT (21U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT117(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT117_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT117_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT118_MASK (0x400000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT118_SHIFT (22U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT118(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT118_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT118_MASK)

