Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT137_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT137_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT137(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT137_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT137_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT138_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT138_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT138(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT138_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT138_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT139_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT139_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT139(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT139_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT139_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT140_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT140_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT140(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT140_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT140_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT141_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT141_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT141(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT141_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT141_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT142_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT142_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT142(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT142_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT142_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT143_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT143_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT143(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT143_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT143_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT144_MASK (0x10000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT144_SHIFT (16U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT144(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT144_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT144_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT145_MASK (0x20000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT145_SHIFT (17U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT145(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT145_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT145_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT146_MASK (0x40000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT146_SHIFT (18U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT146(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT146_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT146_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT147_MASK (0x80000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT147_SHIFT (19U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT147(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT147_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT147_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT148_MASK (0x100000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT148_SHIFT (20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT148(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT148_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT148_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT149_MASK (0x200000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT149_SHIFT (21U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT149(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT149_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT149_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT150_MASK (0x400000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT150_SHIFT (22U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT150(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT150_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT150_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT151_MASK (0x800000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT151_SHIFT (23U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT151(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT151_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT151_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT152_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT152_SHIFT (24U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT152(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT152_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT152_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT153_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT153_SHIFT (25U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT153(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT153_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT153_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT154_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT154_SHIFT (26U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT154(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT154_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT154_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT155_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT155_SHIFT (27U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT155(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT155_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT155_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT156_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT156_SHIFT (28U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT156(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT156_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT156_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT157_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT157_SHIFT (29U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT157(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT157_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT157_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT158_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT158_SHIFT (30U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT158(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT158_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT158_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT159_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT159_SHIFT (31U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT159(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT159_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT159_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_5 - OTP Controller Lock Sticky Register5 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT160_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT160_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT160(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT160_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT160_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT161_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT161_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT161(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT161_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT161_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT162_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT162_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT162(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT162_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT162_MASK)

