Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT163_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT163_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT163(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT163_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT163_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT164_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT164_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT164(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT164_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT164_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT165_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT165_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT165(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT165_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT165_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT166_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT166_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT166(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT166_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT166_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT167_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT167_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT167(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT167_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT167_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT168_MASK (0x100U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT168_SHIFT (8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT168(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT168_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT168_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT169_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT169_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT169(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT169_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT169_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT170_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT170_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT170(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT170_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT170_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT171_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT171_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT171(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT171_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT171_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT172_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT172_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT172(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT172_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT172_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT173_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT173_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT173(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT173_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT173_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT174_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT174_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT174(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT174_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT174_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT175_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT175_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT175(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT175_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_5_LOCK_STICKY_BIT175_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OCOTP_Register_Masks */


/*!
 * @}
 */ /* end of group OCOTP_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_OCOTP_H_ */

